In [92]:
import pandas as pd

# dicionário com autores, titulos e preços
disctionary = {'Autores': ['Rick Riordan', 'J. R. R. Tolkien', 'Rick Riordan', 'Machado de Assis'],
               'Titulos': ['O Ladrão de Raios', 'A Sociedade do Anel', 'Mar de Monstros', 'Memórias Postumas de Brás Cubas'],
               'Preços': [41.2, 35.7, 39.5, 40.5]}

# DataFrame

df = pd.DataFrame(disctionary)

In [93]:
df

            Autores                          Titulos  Preços
0      Rick Riordan                O Ladrão de Raios    41.2
1  J. R. R. Tolkien              A Sociedade do Anel    35.7
2      Rick Riordan                  Mar de Monstros    39.5
3  Machado de Assis  Memórias Postumas de Brás Cubas    40.5

In [94]:
df['Autores'] # Para mostrar lista de autores (coluna)

0        Rick Riordan
1    J. R. R. Tolkien
2        Rick Riordan
3    Machado de Assis
Name: Autores, dtype: object

In [95]:
df['Autores'][1] #Para mostrar o elementos de Autores de uma posição (elemento)

'J. R. R. Tolkien'

In [96]:
df['Preços'].mean() # Média dos preços

39.225

In [97]:
# Filtragem (usando mascara)
mascara = (df['Autores'] == 'Rick Riordan')

print(mascara) # Mostrará em Verdaeiro ou Falso

0     True
1    False
2     True
3    False
Name: Autores, dtype: bool

In [98]:
df[mascara] # Formato de tabela só com os livros do autor buscado

        Autores            Titulos  Preços
0  Rick Riordan  O Ladrão de Raios    41.2
2  Rick Riordan    Mar de Monstros    39.5

In [99]:
# Para adiconar uma nova linha | autor, titulo e preço novo

nova_linha = pd.DataFrame([{'Autores' : 'Stephenie Meyer', 'Titulos' : 'Crepúsculo', 'Preços' : 40.20}])

df = pd.concat([df, nova_linha], ignore_index=True) # 

df

            Autores                          Titulos  Preços
0      Rick Riordan                O Ladrão de Raios    41.2
1  J. R. R. Tolkien              A Sociedade do Anel    35.7
2      Rick Riordan                  Mar de Monstros    39.5
3  Machado de Assis  Memórias Postumas de Brás Cubas    40.5
4   Stephenie Meyer                       Crepúsculo    40.2

In [100]:
# Oura forma de adicionar 

novo_livro = pd.DataFrame([{'Autores' : 'Rick Riordan', 'Titulos' : 'A Maldiçao do Titã', 'Preços' : 41.30}])

df = pd.concat([df, novo_livro], ignore_index=True) # 

df

            Autores                          Titulos  Preços
0      Rick Riordan                O Ladrão de Raios    41.2
1  J. R. R. Tolkien              A Sociedade do Anel    35.7
2      Rick Riordan                  Mar de Monstros    39.5
3  Machado de Assis  Memórias Postumas de Brás Cubas    40.5
4   Stephenie Meyer                       Crepúsculo    40.2
5      Rick Riordan               A Maldiçao do Titã    41.3

In [102]:
mascara = (df['Autores'] == 'Rick Riordan')

df[mascara]

        Autores             Titulos  Preços
0  Rick Riordan   O Ladrão de Raios    41.2
2  Rick Riordan     Mar de Monstros    39.5
5  Rick Riordan  A Maldiçao do Titã    41.3

In [103]:
mascara_correcao = df['Titulos'] == 'Crepúsculo'

df.loc[mascara_correcao]

           Autores     Titulos  Preços
4  Stephenie Meyer  Crepúsculo    40.2

In [104]:
df.loc[mascara_correcao, 'Titulos'] # mostra o que somente eu quero alterar

4    Crepúsculo
Name: Titulos, dtype: object

In [105]:
df.loc[mascara_correcao, 'Titulos'] = 'A Saga Crepúsculo'

df

            Autores                          Titulos  Preços
0      Rick Riordan                O Ladrão de Raios    41.2
1  J. R. R. Tolkien              A Sociedade do Anel    35.7
2      Rick Riordan                  Mar de Monstros    39.5
3  Machado de Assis  Memórias Postumas de Brás Cubas    40.5
4   Stephenie Meyer                A Saga Crepúsculo    40.2
5      Rick Riordan               A Maldiçao do Titã    41.3